app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @product = Product.new
    @products = Product.all

INSERT INTO "products" ("created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 21 Dec 2013 05:35:17 UTC +00:00], ["description", "sad"], ["name", "as"], ["price", 1], ["updated_at", Sat, 21 Dec 2013 05:35:17 UTC +00:00]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = 3  [["description", "Gunny is a pig"], ["updated_at", Sat, 21 Dec 2013 07:36:58 UTC +00:00]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)